{
  "galaxies": [
    {
      "id": "blog",
      "name": "Blog",
      "description": "A place to write about what I’m building, what I’m exploring, and how I think through hard problems.",
      "theme": "purple-white",
      "particleColor": "#0bb2ea",
      "stars": [],
      "solarSystems": []
    },
    {
      "id": "projects",
      "name": "Projects",
      "description": "Selected engineering projects that highlight how I design, build, and iterate on systems.",
      "theme": "blue-white",
      "particleColor": "#d37e1d",
      "stars": [],
      "solarSystems": [
        {
          "id": "agent-foundry",
          "name": "Agent Foundry",
          "theme": "red-giant",
          "mainStar": {
            "id": "forge-star",
            "name": "Forge Star",
            "theme": "red-giant",
            "haloConfig": {
              "color": "#d70909",
              "haloRadius": 1.1,
              "haloIntensity": 60
            }
          },
          "planets": [
            {
              "id": "the-horizon",
              "name": "The Horizon",
              "theme": "blue-green",
              "summary": "The site you're currently on.",
              "contentMarkdown": "# Description\n\n**The Horizon is the interactive universe you're exploring. It's a portfolio platform I designed to feel alive, navigable, and continuously evolving.**\n\nIt combines procedural rendering, structured content, and autonomous development workflows to create a space where I can:\n\n- share the engineering systems I'm building  \n- write about what I'm learning  \n- explore ideas visually instead of in flat lists  \n\nEvery galaxy, system, and planet represents a project, concept, or part of my work.  \nThis world will keep expanding as I grow — the Horizon is designed in a way where it is easy for it to evolve alongside me.\n",
              "moons": [],
              "layoutConfig": {
                "planetRenderScale": 1.2,
                "planetOffsetX": -30,
                "contentPadding": 1.5
              },
              "visualTheme": {
                "preset": "earth-like",
                "glowColor": "#4A90E2",
                "glowIntensity": 0.4,
                "rotationSpeed": 1
              },
              "externalLinks": [
                {
                  "title": "The Horizon",
                  "url": "https://github.com/AgentFoundryExamples/the-horizon",
                  "description": "Check out the source code here!"
                }
              ]
            },
            {
              "id": "agent-foundry",
              "name": "Agent Foundry",
              "theme": "blue-green",
              "summary": "The tool that allows you to explore the horizon.",
              "contentMarkdown": "# Description\n\nAgent Foundry is one of the things I'm most proud of recently, its a pipeline that allows me to create working software from high level specifications completely autonomously while I work on other things. It's a multi stage LLM orchestration system that takes a description of a software tool and turns it into functional software. \n\n### Workflow\n**The flow is as follows:**\n\n- You have an idea for some software so you type up a spec for what you want made.\n- Pass that spec onto Agent Foundry and you have a fully documented and working prototype in a matter of hours.\n- From there you are free to explore the code, test out, and use the software however you like.\n- When you come up with something new to add you write up another spec, pass it to Agent Foundry and it takes care of the rest iterating on your currently implemented version to bring you the new features and refinements you've requested.",
              "moons": [
                {
                  "id": "af-specs",
                  "name": "AF Specs",
                  "contentMarkdown": "# The Specs\n\nTo simplify use for me and any potential user in the future I designed a very simple spec system that I like to equate to a miniature programming language. Because LLMs are stochastic I can not guarantee that 2 identical inputs gives 2 identical outputs but throughout this project we work towards determinism in many ways, this is one.\n\n## How does it work?\n\n**Core Ideas:**\n- There are 5 simple keys that go into an Agent Foundry Spec.\n  - Purpose: A quoted string containing the reason for your spec.\n  - Vision: A quoted string detailing what you want to accomplish with this spec.\n  - Must, Don't, Nice: 3 Lists of quoted strings that detail what Must be accomplished, what not to do, and a few nice to have items that aren't entirely necessary.\n- With a spec written we can hand it off combined with contextual information about the project to generate a implementation plan.\n- There are benefits to having a less strict input for a user but this helps the system with consistency from the beginning."
                },
                {
                  "id": "af-plan",
                  "name": "AF Plan",
                  "contentMarkdown": "# The Plans\n\nThis is where the LLMs start to come into play, the very first is our planning agent. This agent receives the users spec surrounded by a bunch of context about the project which allows it to reason about how to turn the spec into a set of actionable items.\n\n## The Validation\n**These plans go through a determinism checkpoint, the system checks the emitted plan against a schema and will reject any plan that is invalid.**\n\n**This allows us to:**\n- Ensure a consistent input to the next stage of the Pipeline.\n- Have confidence in the plan, we are giving the LLM a set of complicated instructions and the output requirements are the smallest piece of this. Following the output requirements gives us higher confidence the rest of the instructions were followed well.\n- Identify where the system drifts, rejected plans are logged and used to refine prompts and learn more about what specs cause failures. Each rejection is a learning opportunity."
                }
              ],
              "visualTheme": {
                "preset": "volcanic",
                "glowColor": "#FF4500",
                "glowIntensity": 0.6,
                "rotationSpeed": 1.2
              },
              "externalLinks": [
                {
                  "title": "Example Repositories",
                  "url": "https://github.com/AgentFoundryExamples",
                  "description": "Check out some examples here!"
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "about",
      "name": "About",
      "description": "Who I am, what I build, and the principles that guide my work.",
      "theme": "dark-blue",
      "particleColor": "#2912d3",
      "stars": [],
      "solarSystems": [
        {
          "id": "my-system",
          "name": "My System",
          "theme": "orange-dwarf",
          "mainStar": {
            "id": "the-origin",
            "name": "The Origin",
            "theme": "orange-dwarf"
          },
          "planets": []
        }
      ]
    }
  ]
}